app/views/users/likes.html.erb

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 3 LIMIT 1
---

        <%post=Post.find_by(id: like.post_id) %>