app/views/posts/index.html.erb

        <%= link_to(list.tag_name, tag_posts_path(tag_id: list.id))%>
        <%="#{list.posts.count}"%>投稿
---
SELECT COUNT(*) FROM `posts`
SELECT `posts`.* FROM `posts` LIMIT 1 OFFSET 0

            </div>
            <p class="caption"><%= "#{post.comments.count} コメント" %></p>
---
SELECT COUNT(*) FROM `comments` WHERE `comments`.`post_id` = 6