app/views/posts/show.html.erb

SELECT COUNT(*) FROM `posts` INNER JOIN `tag_maps` ON `posts`.`id` = `tag_maps`.`post_id` WHERE `tag_maps`.`tag_id` = 2
---
            <%=link_to(tag.tag_name, tag_posts_path(tag_id: tag.id))%>
            <%="#{tag.posts.count}"%>

SELECT `likes`.* FROM `likes` WHERE `likes`.`user_id` = 1 AND `likes`.`post_id` = 2 LIMIT 1
---
                <%= @post.created_at %>
                <% if Like.find_by(user_id:@current_user.id,post_id:@post.id)%>