app/controllers/comments_controller.rb

  def create
    post = Post.find(params[:post_id])
    @comment = post.comments.new(comment_params)
    @comment.user_id = current_user.id
    if @comment.save
      post.create_notification_comment!(current_user, @comment.id)
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
INSERT INTO `comments` (`content`, `user_id`, `post_id`, `created_at`, `updated_at`) VALUES ('コメントできます', 1, 2, '2022-04-04 12:00:07.598864', '2022-04-04 12:00:07.598864')
INSERT INTO `notifications` (`visitor_id`, `visited_id`, `post_id`, `action`, `created_at`, `updated_at`) VALUES (2, 1, 1, 'comment', '2022-06-01 11:18:03.648632', '2022-06-01 11:18:03.648632')

  def destroy
    current_user.comments.find(params[:id]).destroy!
---
DELETE FROM `comments` WHERE `comments`.`id` = 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`user_id` = 2 AND `comments`.`id` = 1 LIMIT 1

  def edit
    @comment = Comment.find(params[:id])
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 25 LIMIT 1

  def update
    @comment = current_user.comments.find(params[:id])
    @comment.content = params[:content]
    flash[:notice] = if @comment.save
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`user_id` = 2 AND `comments`.`id` = 25 LIMIT 1
UPDATE `comments` SET `comments`.`content` = 'そうですね。', `comments`.`updated_at` = '2022-06-01 15:35:54.631808' WHERE `comments`.`id` = 25