app/controllers/guest_sessions_controller.rb

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('ゲストユーザー', 'guest@exapmle.com', '2022-04-03 13:55:29.095160', '2022-04-03 13:55:29.095160', '$2a$12$a59dz7Xv5Ou6r9nUqMR/juIIu3s42mRuO/qhJys2pN0hrrRfV9pf2')
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'guest@exapmle.com' LIMIT 1
---
  def new_guest
    user = User.find_or_create_by(email: 'guest@exapmle.com') do |user|