app/controllers/likes_controller.rb

INSERT INTO `likes` (`user_id`, `post_id`, `created_at`, `updated_at`) VALUES (1, 2, '2022-04-04 11:59:57.089119', '2022-04-04 11:59:57.089119')
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
INSERT INTO `notifications` (`visitor_id`, `visited_id`, `post_id`, `action`, `created_at`, `updated_at`) VALUES (2, 1, 1, 'like', '2022-06-01 11:24:49.562296', '2022-06-01 11:24:49.562296')
---
  def create
    @like = Like.new(
      user_id: @current_user.id,
      post_id: params[:post_id]
    )

    @like.save
    post = Post.find(params[:post_id])
    post.create_notification_like!(current_user)

SELECT `likes`.* FROM `likes` WHERE `likes`.`user_id` = 2 AND `likes`.`post_id` = 1 LIMIT 1
DELETE FROM `likes` WHERE `likes`.`id` = 1
---
  def destroy
    @like = Like.find_by(
      user_id: @current_user.id,
      post_id: params[:post_id]
    )
    @like.destroy