app/controllers/messages_controller.rb

  def create
    if Entry.where(user_id: current_user.id, room_id: params[:message][:room_id]).present?
      @message = Message.create(params.require(:message).permit(:user_id, :content,
                                                                :room_id).merge(user_id: current_user.id))
---
SELECT `entries`.* FROM `entries` WHERE `entries`.`user_id` = 2 AND `entries`.`room_id` = 1
INSERT INTO `messages` (`user_id`, `room_id`, `content`, `created_at`, `updated_at`) VALUES (2, 1, 'よろしくお願いします', '2022-05-21 22:33:48.330766', '2022-05-21 22:33:48.330766')