app/controllers/notifications_controller.rb

UPDATE `notifications` SET `notifications`.`checked` = TRUE, `notifications`.`updated_at` = '2022-06-08 11:48:08.116878' WHERE `notifications`.`id` = 4
---
  def index
    @notifications = current_user.passive_notifications.page(params[:page]).per(20)

    @notifications.where(checked: false).each do |notification|
      notification.update(checked: true)