app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
---
  def ensure_correct_user
    @post = Post.find_by(id: params[:id])

SELECT COUNT(*) FROM `posts`
SELECT `posts`.* FROM `posts` LIMIT 1 OFFSET 0
---
  def index
    @posts = Post.all.order(created_at: :desc)
    @posts = Post.all.page(params[:page]).per(1)

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 2
SELECT COUNT(*) FROM (SELECT 1 AS one FROM `comments` WHERE `comments`.`post_id` = 2 ORDER BY `comments`.`id` DESC LIMIT 7 OFFSET 0) subquery_for_count
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 2 ORDER BY `comments`.`id` DESC LIMIT 7 OFFSET 0
---
  def show
    @post = Post.find_by(id: params[:id])

    @user = @post.user
    @likes_count = Like.where(post_id: @post.id).count
    @comment = Comment.new
    @comments = @post.comments.page(params[:page]).per(7).reverse_order

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
---
  def edit
    @post = Post.find_by(id: params[:id])

INSERT INTO `posts` (`content`, `created_at`, `updated_at`, `user_id`) VALUES ('食事は１日の中で大切な時間です', '2021-08-09 03:49:10.561035', '2021-08-09 03:49:10.561035', 1)
---
  def create
    @post = Post.new(
      content: params[:content],
      user_id: @current_user.id
    )

    @post.transaction do
      @post.save!

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
UPDATE `posts` SET `posts`.`updated_at` = '2022-04-04 11:59:49.553163' WHERE `posts`.`id` = 2
---
  def update
    @post = Post.find_by(id: params[:id])
    @post.content = params[:content]
    if @post.save

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 4 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 4
---
  def destroy
    @post = Post.find_by(id: params[:id])
    @post.destroy

SELECT `posts`.* FROM `posts` WHERE (content LIKE '%ご飯%')
---
  def search
    @posts = if params[:content].present?
               Post.where('content LIKE ?', "%#{params[:content]}%")