app/controllers/posts_controller.rb

SELECT `tags`.* FROM `tags`
---
  def index
    @posts = Post.all.order(created_at: :desc)
    @posts = Post.all.page(params[:page]).per(1)
    @tag_list = Tag.all

INSERT INTO `tags` (`tag_name`, `created_at`, `updated_at`) VALUES ('たこ焼き　お好み焼き', '2022-04-04 11:58:19.531576', '2022-04-04 11:58:19.531576')
---
  def create
    @post = Post.new(
      content: params[:content],

      user_id: @current_user.id
    )

    tag_list = params[:post][:tag_name].split(nil)
    if image = params[:post][:image]
      @post.image.attach(image)

    end
    if @post.save
      @post.save_tag(tag_list)