app/controllers/relationships_controller.rb

  def create
    following = @current_user.follow(params[:user_id])
    flash[:notice] = if following.save
                       @user.create_notification_follow!(current_user)
---
INSERT INTO `notifications` (`visitor_id`, `visited_id`, `action`, `created_at`, `updated_at`) VALUES (3, 2, 'follow', '2022-06-08 11:45:57.125154', '2022-06-08 11:45:57.125154')

  def followings
    user = User.find(params[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def followers
    user = User.find(params[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1