app/controllers/rooms_controller.rb

  def create
    @room = Room.create
    @entry1 = Entry.create(
      room_id: @room.id,
      user_id: current_user.id
    )
    @entry2 = Entry.create(params.require(:entry).permit(:user_id, :room_id).merge(room_id: @room.id))
---
INSERT INTO `rooms` (`created_at`, `updated_at`) VALUES ('2022-06-08 11:48:29.599773', '2022-06-08 11:48:29.599773')
INSERT INTO `entries` (`user_id`, `room_id`, `created_at`, `updated_at`) VALUES (1, 1, '2022-05-19 20:53:37.355207', '2022-05-19 20:53:37.355207')
INSERT INTO `entries` (`user_id`, `room_id`, `created_at`, `updated_at`) VALUES (3, 2, '2022-06-08 11:48:29.638988', '2022-06-08 11:48:29.638988')

  def show
    @room = Room.find(params[:id])
    if Entry.where(user_id: @current_user.id, room_id: @room.id).present?
      @messages = @room.messages
      @message = Message.new
      @entries = @room.entries
    else
      redirect_back(fallback_location: root_path)
    end
    @notifications = current_user.passive_notifications.where(room_id: @room.id)
---
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1
SELECT `entries`.* FROM `entries` WHERE `entries`.`user_id` = 2 AND `entries`.`room_id` = 1
SELECT `messages`.* FROM `messages` WHERE `messages`.`room_id` = 1
SELECT `entries`.* FROM `entries` WHERE `entries`.`room_id` = 1 AND `entries`.`user_id` != 2 ORDER BY `entries`.`id` ASC LIMIT 1