app/controllers/users_controller.rb

SELECT `entries`.* FROM `entries` WHERE `entries`.`user_id` = 2
SELECT `entries`.* FROM `entries` WHERE `entries`.`user_id` = 1
---
  def show
    @user = User.find_by(id: params[:id])
    @currentUserEntry=Entry.where(user_id: current_user.id)
    @userEntry=Entry.where(user_id: @user.id)
    if @user.id == current_user.id
    else
      @currentUserEntry.each do |cu|
        @userEntry.each do |u|

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'engineering@science.jp' LIMIT 1
---
  def login
    @user = User.find_by(email: params[:email])

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `image_name`, `password_digest`) VALUES ('エンジニア（仮）', 'engineering@science.jp', '2022-05-19 14:55:03.665408', '2022-05-19 14:55:03.665408', 'default_user.jpg', '$2a$12$r65wJAB1xn6Ne3ZMSnMgNunWELjxG/noI/2/i9hRiP6I.wBwmqiye')
---
  def create
    @user = User.new(
      name: params[:name],
      email: params[:email],
      image_name: 'default_user.jpg',
      password: params[:password]
    )
    @user.transaction do
      @user.save!