app/controllers/users_controller.rb

  def index
    @users = User.all
    @users = User.all.page(params[:page]).per(1)
---
SELECT `users`.* FROM `users` LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM `users`

  def edit
    @user = User.find_by(id: params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def show
    @user = User.find_by(id: params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]
    if params[:image]
      @user.image_name = "#{@user.id}.jpg"
      image = params[:image]
      File.binwrite("public/user_images/#{@user.image_name}", image.read)
    end

    if @user.save
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `users`.`updated_at` = '2021-08-09 09:36:12.067182', `users`.`image_name` = '2.jpg' WHERE `users`.`id` = 2

  def login
    @user = User.find_by(email: params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'muscle@training.com' LIMIT 1

  def create
    @user = User.new(
      name: params[:name],
      email: params[:email],
      image_name: 'default_user.jpg',
      password: params[:password]
    )
    @user.transaction do
      @user.save!
---
INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `image_name`, `password_digest`) VALUES ('筋肉マッチョ', 'muscle@training.com', '2021-08-02 09:45:49.603815', '2021-08-02 09:45:49.603815', 'default_user.jpg', '$2a$12$Yclbot5bv1rrfpwXpUGPCuXlDuyZkV3XXT/niW.YrO8TSIEpi0Jyu')

  def likes
    @user = User.find_by(id: params[:id])
    @likes = Like.where(user_id: @user.id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `likes`.* FROM `likes` WHERE `likes`.`user_id` = 2

  def search
    @users = if params[:name].present?
               User.where('name LIKE ?', "%#{params[:name]}%")
---
SELECT `users`.* FROM `users` WHERE (name LIKE '%エンジニア（仮）%')