app/models/post.rb

  def user
    User.find_by(id: user_id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def save_tag(sent_tags)
    current_tags = tags.pluck(:tag_name) unless tags.nil?
    old_tags = current_tags - sent_tags
    new_tags = sent_tags - current_tags

    old_tags.each do |old|
      tags.delete Tag.find_by(tag_name: old)
    end

    new_tags.each do |new|
      new_post_tag = Tag.find_or_create_by(tag_name: new)
---
INSERT INTO `tags` (`tag_name`, `created_at`, `updated_at`) VALUES ('たこ焼き　お好み焼き', '2022-06-01 09:58:00.584744', '2022-06-01 09:58:00.584744')
SELECT `tags`.* FROM `tags` WHERE `tags`.`tag_name` = 'たこ焼き　お好み焼き' LIMIT 1

  def create_notification_comment!(current_user, comment_id)
    # 自分以外にコメントしている人をすべて取得し、全員に通知を送る
    temp_ids = Comment.select(:user_id).where(post_id: id).where.not(user_id: current_user.id).distinct
    temp_ids.each do |temp_id|
---
SELECT DISTINCT `comments`.`user_id` FROM `comments` WHERE `comments`.`post_id` = 1 AND `comments`.`user_id` != 2

  def save_notification_comment!(current_user, _comment_id, visited_id)
    # コメントは複数回することが考えられるため、１つの投稿に複数回通知する
    notification = current_user.active_notifications.new(
      comment_id: @comment_id,
      post_id: id,
      visited_id: visited_id,
      action: 'comment'
    )
    # 自分の投稿に対するコメントの場合は、通知済みとする
    notification.checked = true if notification.visitor_id == notification.visited_id
    notification.save if notification.valid?
---
INSERT INTO `notifications` (`visitor_id`, `visited_id`, `post_id`, `action`, `created_at`, `updated_at`) VALUES (2, 1, 1, 'comment', '2022-06-01 11:18:03.648632', '2022-06-01 11:18:03.648632')

  def create_notification_like!(current_user)
    # すでに「いいね」されているか検索
    temp = Notification.where(['visitor_id = ? and visited_id = ? and post_id = ? and action = ? ', current_user.id,
                               user_id, id, 'like'])
    # いいねされていない場合のみ、通知レコードを作成
    if temp.blank?
      notification = current_user.active_notifications.new(
        post_id: id,
        visited_id: user_id,
        action: 'like'
      )
      # 自分の投稿に対するいいねの場合は、通知済みとする
      notification.checked = true if notification.visitor_id == notification.visited_id
      notification.save if notification.valid?
---
SELECT `notifications`.* FROM `notifications` WHERE (visitor_id = 2 and visited_id = 1 and post_id = 1 and action = 'like' )
INSERT INTO `notifications` (`visitor_id`, `visited_id`, `post_id`, `action`, `created_at`, `updated_at`) VALUES (2, 1, 1, 'like', '2022-06-01 11:24:49.562296', '2022-06-01 11:24:49.562296')