app/models/user.rb

  def follow(_user_id)
    relationships.create(followed_id: user_id)
---
INSERT INTO `relationships` (`follower_id`, `followed_id`, `created_at`, `updated_at`) VALUES (2, 1, '2022-06-01 11:25:17.823242', '2022-06-01 11:25:17.823242')

  def unfollow(user_id)
    relationships.find_by(followed_id: user_id).destroy
---
DELETE FROM `relationships` WHERE `relationships`.`id` = 1

  def create_notification_follow!(current_user)
    temp = Notification.where(['visitor_id = ? and visited_id = ? and action = ? ', current_user.id, id, 'follow'])
    if temp.blank?
      notification = current_user.active_notifications.new(
        visited_id: id,
        action: 'follow'
      )
      notification.save if notification.valid?
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `notifications`.* FROM `notifications` WHERE (visitor_id = 3 and visited_id = 2 and action = 'follow' ) ORDER BY `notifications`.`created_at` DESC
INSERT INTO `notifications` (`visitor_id`, `visited_id`, `action`, `created_at`, `updated_at`) VALUES (3, 2, 'follow', '2022-06-08 11:45:57.125154', '2022-06-08 11:45:57.125154')